load-tests/squadz-1200.yml
config:
  target: "https://joinsquadz.com"

  payload:
    path: ".test-accounts.csv"
    fields:
      - token
      - email
      - userId
    skipHeader: true
    order: sequence

  # 1200 peak concurrent: 600 arrivals/s × ~2s avg scenario duration
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5

    - name: "Ramp up"
      duration: 60
      arrivalRate: 5
      rampTo: 300       # 5→300/s over 60s → ~10→600 concurrent

    - name: "Sustained load (600 concurrent)"
      duration: 60
      arrivalRate: 300

    - name: "Peak (1200 concurrent)"
      duration: 60
      arrivalRate: 600  # 600/s × 2s ≈ 1200 concurrent

    - name: "Sustain peak"
      duration: 60
      arrivalRate: 600

  http:
    timeout: 10
    maxSockets: 1800    # 1.5× peak concurrent

scenarios:
  - name: "Hot read path"
    weight: 1
    flow:
      - get:
          url: "/api/squads"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/events"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/feed"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/activity"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/user/preferences"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200