load-tests/squadz-300.yml
config:
  target: "https://joinsquadz.com"

  payload:
    path: ".test-accounts.csv"
    fields:
      - token
      - email
      - userId
    skipHeader: true
    order: sequence

  # 300 peak concurrent: 150 arrivals/s × ~2s avg scenario duration
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5

    - name: "Ramp up"
      duration: 60
      arrivalRate: 5
      rampTo: 75        # 5→75/s over 60s → ~10→150 concurrent

    - name: "Sustained load (150 concurrent)"
      duration: 60
      arrivalRate: 75

    - name: "Peak (300 concurrent)"
      duration: 60
      arrivalRate: 150  # 150/s × 2s ≈ 300 concurrent

    - name: "Sustain peak"
      duration: 60
      arrivalRate: 150

  http:
    timeout: 10
    maxSockets: 450     # 1.5× peak concurrent

scenarios:
  - name: "Hot read path"
    weight: 1
    flow:
      - get:
          url: "/api/squads"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/events"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/feed"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/activity"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/user/preferences"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200