load-tests/squadz-600.yml
config:
  target: "https://joinsquadz.com"

  payload:
    path: ".test-accounts.csv"
    fields:
      - token
      - email
      - userId
    skipHeader: true
    order: sequence

  # 600 peak concurrent: 300 arrivals/s × ~2s avg scenario duration
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5

    - name: "Ramp up"
      duration: 60
      arrivalRate: 5
      rampTo: 150       # 5→150/s over 60s → ~10→300 concurrent

    - name: "Sustained load (300 concurrent)"
      duration: 60
      arrivalRate: 150

    - name: "Peak (600 concurrent)"
      duration: 60
      arrivalRate: 300  # 300/s × 2s ≈ 600 concurrent

    - name: "Sustain peak"
      duration: 60
      arrivalRate: 300

  http:
    timeout: 10
    maxSockets: 900     # 1.5× peak concurrent

scenarios:
  - name: "Hot read path"
    weight: 1
    flow:
      - get:
          url: "/api/squads"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/events"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/feed"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/activity"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
      - think: 0.3

      - get:
          url: "/api/user/preferences"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200